Curso_CFD_2018/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       29830;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       29850;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       29910;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       29980;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       30050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30000;
        startFace       30170;
    }
)

// ************************************************************************* //
